## base
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
vpc.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 13 to add, 2 to change, 13 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        NAME                         |
|----------|-----------------------------------------------------|
| update   | `module.vpc.aws_network_acl.main`                   |
|          | `module.vpc.aws_route.private_nat_gateway[0]`       |
| recreate | `module.vpc.aws_nat_gateway.nat_gw[0]`              |
|          | `module.vpc.aws_route_table_association.private[0]` |
|          | `module.vpc.aws_route_table_association.private[1]` |
|          | `module.vpc.aws_route_table_association.private[2]` |
|          | `module.vpc.aws_route_table_association.public[0]`  |
|          | `module.vpc.aws_route_table_association.public[1]`  |
|          | `module.vpc.aws_route_table_association.public[2]`  |
|          | `module.vpc.aws_subnet.private[0]`                  |
|          | `module.vpc.aws_subnet.private[1]`                  |
|          | `module.vpc.aws_subnet.private[2]`                  |
|          | `module.vpc.aws_subnet.public[0]`                   |
|          | `module.vpc.aws_subnet.public[1]`                   |
|          | `module.vpc.aws_subnet.public[2]`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_nat_gateway.nat_gw[0] must be replaced
-/+ resource "aws_nat_gateway" "nat_gw" {
      ~ association_id                     = "eipassoc-06f36be02038e2cc1" -> (known after apply)
      ~ id                                 = "nat-0e92f4835b777732a" -> (known after apply)
      ~ network_interface_id               = "eni-07928b09c16a31099" -> (known after apply)
      ~ private_ip                         = "10.0.3.106" -> (known after apply)
      ~ public_ip                          = "3.97.108.168" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-06232d010648c0125" -> (known after apply) # forces replacement
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base-natgw-0"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-0d1ad57fa9c0143de"
      ~ subnet_ids = [
          - "subnet-06232d010648c0125",
          - "subnet-07f8e17bbf11b0797",
          - "subnet-08cab5daf34489c53",
          - "subnet-09cff449a77650ae4",
          - "subnet-0d92713028fd15243",
          - "subnet-0fa7c392bf00d664a",
        ] -> (known after apply)
        tags       = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_main_nacl"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-01f5b7be12a15c9ef1080289494"
      ~ nat_gateway_id         = "nat-0e92f4835b777732a" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-02ab41725f5892ead" -> (known after apply)
      ~ subnet_id      = "subnet-08cab5daf34489c53" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0f2ab9cf5ef32ca5c" -> (known after apply)
      ~ subnet_id      = "subnet-07f8e17bbf11b0797" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-00a67e6a8bd800666" -> (known after apply)
      ~ subnet_id      = "subnet-0d92713028fd15243" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-02847d6bc5e7a362e" -> (known after apply)
      ~ subnet_id      = "subnet-06232d010648c0125" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0a642adef65567894" -> (known after apply)
      ~ subnet_id      = "subnet-09cff449a77650ae4" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0dc5bbdd2323d1394" -> (known after apply)
      ~ subnet_id      = "subnet-0fa7c392bf00d664a" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:794722365809:subnet/subnet-08cab5daf34489c53" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.0.0/24" -> "10.0.0.0/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-08cab5daf34489c53" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "794722365809" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_private_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Private"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:794722365809:subnet/subnet-07f8e17bbf11b0797" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.1.0/24" -> "10.0.0.64/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-07f8e17bbf11b0797" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "794722365809" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_private_subnet_ca-central-1b"
            "Terraform"  = "true"
            "Tier"       = "Private"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:794722365809:subnet/subnet-0d92713028fd15243" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.2.0/24" -> "10.0.0.128/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0d92713028fd15243" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "794722365809" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_private_subnet_ca-central-1d"
            "Terraform"  = "true"
            "Tier"       = "Private"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:794722365809:subnet/subnet-06232d010648c0125" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.0.3.0/24" -> "10.0.0.192/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-06232d010648c0125" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "794722365809" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_public_subnet_ca-central-1a"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:794722365809:subnet/subnet-09cff449a77650ae4" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.1.0/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-09cff449a77650ae4" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "794722365809" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_public_subnet_ca-central-1b"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:ca-central-1:794722365809:subnet/subnet-0fa7c392bf00d664a" -> (known after apply)
      ~ availability_zone_id                           = "cac1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.5.0/24" -> "10.0.1.64/26" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0fa7c392bf00d664a" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "794722365809" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-base_public_subnet_ca-central-1d"
            "Terraform"  = "true"
            "Tier"       = "Public"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 13 to add, 2 to change, 13 to destroy.

Changes to Outputs:
  ~ vpc_private_subnet_cidrs = [
      - "10.0.0.0/24",
      - "10.0.1.0/24",
      - "10.0.2.0/24",
      + "10.0.0.0/26",
      + "10.0.0.64/26",
      + "10.0.0.128/26",
    ]
  ~ vpc_private_subnet_ids   = [
      - "subnet-08cab5daf34489c53",
      - "subnet-07f8e17bbf11b0797",
      - "subnet-0d92713028fd15243",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ vpc_public_subnet_cidrs  = [
      - "10.0.3.0/24",
      - "10.0.4.0/24",
      - "10.0.5.0/24",
      + "10.0.0.192/26",
      + "10.0.1.0/26",
      + "10.0.1.64/26",
    ]
  ~ vpc_public_subnet_ids    = [
      - "subnet-06232d010648c0125",
      - "subnet-09cff449a77650ae4",
      - "subnet-0fa7c392bf00d664a",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]

Warning: Argument is deprecated

  with module.athena.aws_s3_bucket.this,
  on .terraform/modules/athena/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
